###################################################################

# Created by write_sdc on Fri Jan 16 19:12:25 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.02 [get_ports output_valid]
set_load -pin_load 0.02 [get_ports {output_result[16]}]
set_load -pin_load 0.02 [get_ports {output_result[15]}]
set_load -pin_load 0.02 [get_ports {output_result[14]}]
set_load -pin_load 0.02 [get_ports {output_result[13]}]
set_load -pin_load 0.02 [get_ports {output_result[12]}]
set_load -pin_load 0.02 [get_ports {output_result[11]}]
set_load -pin_load 0.02 [get_ports {output_result[10]}]
set_load -pin_load 0.02 [get_ports {output_result[9]}]
set_load -pin_load 0.02 [get_ports {output_result[8]}]
set_load -pin_load 0.02 [get_ports {output_result[7]}]
set_load -pin_load 0.02 [get_ports {output_result[6]}]
set_load -pin_load 0.02 [get_ports {output_result[5]}]
set_load -pin_load 0.02 [get_ports {output_result[4]}]
set_load -pin_load 0.02 [get_ports {output_result[3]}]
set_load -pin_load 0.02 [get_ports {output_result[2]}]
set_load -pin_load 0.02 [get_ports {output_result[1]}]
set_load -pin_load 0.02 [get_ports {output_result[0]}]
create_clock [get_ports clk]  -period 25  -waveform {0 12.5}
set_clock_uncertainty 0.2  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_false_path   -from [get_ports reset]
set_input_delay -clock clk  2  [get_ports reset]
set_input_delay -clock clk  2  [get_ports en]
set_input_delay -clock clk  2  [get_ports data_valid]
set_input_delay -clock clk  2  [get_ports {weight[3]}]
set_input_delay -clock clk  2  [get_ports {weight[2]}]
set_input_delay -clock clk  2  [get_ports {weight[1]}]
set_input_delay -clock clk  2  [get_ports {weight[0]}]
set_input_delay -clock clk  2  [get_ports {activation[7]}]
set_input_delay -clock clk  2  [get_ports {activation[6]}]
set_input_delay -clock clk  2  [get_ports {activation[5]}]
set_input_delay -clock clk  2  [get_ports {activation[4]}]
set_input_delay -clock clk  2  [get_ports {activation[3]}]
set_input_delay -clock clk  2  [get_ports {activation[2]}]
set_input_delay -clock clk  2  [get_ports {activation[1]}]
set_input_delay -clock clk  2  [get_ports {activation[0]}]
set_input_delay -clock clk  2  [get_ports acc]
set_output_delay -clock clk  2  [get_ports output_valid]
set_output_delay -clock clk  2  [get_ports {output_result[16]}]
set_output_delay -clock clk  2  [get_ports {output_result[15]}]
set_output_delay -clock clk  2  [get_ports {output_result[14]}]
set_output_delay -clock clk  2  [get_ports {output_result[13]}]
set_output_delay -clock clk  2  [get_ports {output_result[12]}]
set_output_delay -clock clk  2  [get_ports {output_result[11]}]
set_output_delay -clock clk  2  [get_ports {output_result[10]}]
set_output_delay -clock clk  2  [get_ports {output_result[9]}]
set_output_delay -clock clk  2  [get_ports {output_result[8]}]
set_output_delay -clock clk  2  [get_ports {output_result[7]}]
set_output_delay -clock clk  2  [get_ports {output_result[6]}]
set_output_delay -clock clk  2  [get_ports {output_result[5]}]
set_output_delay -clock clk  2  [get_ports {output_result[4]}]
set_output_delay -clock clk  2  [get_ports {output_result[3]}]
set_output_delay -clock clk  2  [get_ports {output_result[2]}]
set_output_delay -clock clk  2  [get_ports {output_result[1]}]
set_output_delay -clock clk  2  [get_ports {output_result[0]}]
